Tekla Open API Reference for Tekla Structures 2025
AutoDirectionTypeAttribute Constructor
Overload List
Name | Description
AutoDirectionTypeAttribute(Int32)
 The custom attribute [AutoDirectionType()] uses this to store the auto direction type to the system. This is not to be used by itself.
AutoDirectionTypeAttribute(AutoDirectionTypeEnum)
 The custom attribute [AutoDirectionType()] uses this to store the auto direction type to the system. This is not to be used by itself.
Top
See Also
Reference
AutoDirectionTypeAttribute Class
Tekla.Structures.Plugins Namespace